var product = [{
    id:1,
    img: '74725.jpg',
    name: ' ตังเซียม',
    price: 500,
    description: 'ตังเซียม สมุนไพรบำรุงพลังชีวิต มีคุณสมบัติคล้ายโสม แต่ฤทธิ์อ่อนกว่า บางครั้งก็นิยมนำมาใช้แทนโสม ร่วมกับสมุนไพรชนิดอื่น ๆ และได้รับฉายาว่า “โสมคนจน” ช่วยเสริมภูมิคุ้มกันให้ร่างกาย แก้อาการอ่อนเพลีย เหนื่อยล้าคุณสมบัติทางยา : กระตุ้นการไหลเวียนเลือด ป้องกันและรักษาโรคเกี่ยวกับหลอดเลือดหัวใจ ช่วยในการนอนหลับ ใช้รักษาอาการนอนไม่หลับในผู้ป่วยที่มีอาการนอนไม่หลับเรื้อรัง ช่วยปรับระบบทางเดินอาหาร.',
    type: 'สมุนไพรจีน'
    
},{
    id:2,
    img: '14725.jpg',
    name: '當歸(ตังกุย)',
    price: 300,
    description: '"ตังกุย" หรือ "โสมตังกุย" ชื่อไทยเรียกว่า "โกฐเชียง" เป็นสมุนไพรที่ไม่ได้นิยมแค่ในจีนเท่านั้น แต่ญี่ปุ่นและเกาหลีก็นิยมกินตังกุยเพื่อบำรุงร่างกายเช่นกัน ตังกุยถือว่าเป็นสมุนไพรสำหรับสตรี เพราะสามารถช่วยบรรเทาอาการปวดประจำเดือน อาการร้อนวูบวาบที่เกิดจากวัยทอง และเป็นสมุนไพรที่ช่วยเรื่องการไหลเวียนของระบบเลือดในร่างกาย เป็นสมุนไพรที่มีคุณประโยชน์หลากหลาย |คุณสมบัติทางยา : รสหวาน เผ็ด ขมเล็กน้อย บำรุงตับ หัวใจ และม้าม บำรุงเลือด ช่วยการไหลเวียนของเลือด ทำให้ประจำเดือนสม่ำเสมอ ช่วยบรรเทาอาการปวดไมเกรนและปวดประจำเดือน',
    type: "สมุนไพรจีน"

},{
    id:3,
    img: '24725.jpg',
    name: 'เก๋ากี้',
    price: 200,
    description: '"เก๋ากี้" หรือ "โกจิเบอร์รี" เป็นสมุนไพรจีนที่มีมานานกว่า 2,000 ปีแล้ว หลิน หยูอี้ นักกวีชาวจีนสมัยราชวงศ์ถัง เคยแต่งกวีที่มีชื่อว่า บ่อน้ำแห่งความเยาว์วัย และได้พูดถึงเก๋ากี้ในบทกลอนด้วย หมอคนนึงได้ไปเยี่ยมหมู่บ้านนานชูในจีนที่มีคนอายุยืนมากกว่า 100 ปีหลายคน เขาได้ค้นพบว่า เคล็ดลับของความอายุยืนคือ ในหมู่บ้านมีบ่อน้ำที่ล้อมรอบไปด้วยต้นเก๋ากี้ และเมื่อผลเก๋ากี้หล่นลงไปในบ่อน้ำ ทำให้ในน้ำนั้นอุดมไปด้วยวิตามิน และทำให้คนที่ดื่มน้ำในบ่อน้ำนั้นมีอายุที่ยืนยาวกว่าคนทั่วไปคุณสมบัติทางยา : มีรสหวาน สุขุม ช่วยบำรุงตับและไต ช่วยบำรุงสายตา มีวิตามินซีสูง มีสารแอนตี้ออกซิแดนท์ อุดมไปด้วยวิตามิน B1, B2, B6 และมีแร่ธาตุที่สำคัญอีกหลายชนิด ',
    type: "สมุนไพรจีน"
},{
    id:4,
    img: '34275.jpg',
    name: 'ฮ่วยซัว',
    price: 100,
    description: 'เป็นพืชหัวตระกูลกลอย หลาย ๆ คนอาจจะเรียกว่า "กลอยจีน" หรือ "มันเทศจีน" เป็นสมุนไพรที่ช่วยปรับพลังหยินในร่างกาย มีฤทธิ์เย็น ในญี่ปุ่นหรือเกาหลีนิยมกินแบบสด ๆ หรือนำมาแปรรูปเป็นเส้น ทำเป็นเส้นบะหมี่ หรือนำมาโรยตกแต่งคุณสมบัติทางยา : ช่วยเสริมสมรรถภาพทางเพศ ช่วยบำรุงร่างกาย ฟื้นฟูพละกำลัง แก้เหนื่อยล้า บำรุงกระเพาะ ม้าม ไต บำรุงสมอง ขับของเสีย ช่วยเรื่องหวัดและแก้ร้อนใน',
    type: "สมุนไพรจีน"
},{
    id:5,
    img: '44725.jpg',
    name: 'พุทราจีน',
    price: 300,
    description: 'เป็นผลไม้ที่พบเห็นได้ทุกที่ในประเทศไทย เพราะสามารถปลูกในประเทศไทยได้ พุทราจีนมีต้นกำเนิดจากประเทศจีนตอนใต้ เป็นผลไม้ที่อุดมไปด้วยวิตามิน มีสารแอนตี้ออกซิแดนท์ ช่วยบำรุงผิว และเป็นผลไม้ที่มีแคลอรีต่ำ เหมาะสำหรับผู้ที่กำลังลดน้ำหนักคุณสมบัติทางยา : มีรสหวาน อุดมไปด้วยสารต้านอนุมูลอิสระ ช่วยบำรุงผิวพรรณ ช่วยบำรุงกระเพาะ ม้าม ระบบย่อยอาหาร บำรุงหัวใจ บำรุงเลือด เพิ่มพละกำลัง แก้ความอ่อนเพลีย เปลือกของพุทรามีฤทธิ์แก้ท้องเสีย อ่านต่อได้ที่ ',
    type: "สมุนไพรจีน"
},{
    id:6,
    img: '54725.jpg',
    name: 'ชวงเกียง',
    price: 500,
    description: '"โกฐหัวบัว" สมุนไพรที่นิยมใช้แพร่หลายทั้งในจีนและในไทย เป็นพืชล้มลุก ส่วนที่นำมาทำยาเป็นส่วนเหง้า มีหลากหลายสายพันธุ์ในประเทศไทย ส่วนใหญ่ใช้เป็นส่วนผสมในยาหอม ยาแก้ไข้ แก้ไอ กลิ่นหอมฉุน รสขม เผ็ด หวานเล็กน้อยตามด้วยชาลิ้นคุณสมบัติทางยา : มีฤทธิ์กระตุ้นการไหลเวียนของพลังชี่และเลือด เป็นยาขับลม ช่วยบรรเทาอาการจุกเสียด แน่นท้องจากลมที่มีมากเกินในกระเพาะ ช่วยแก้อาการปวดเมื่อยทางร่างกาย ระงับปวด เป็นยาแก้ไข้ แก้ไอ บำรุงโลหิต แก้ริดสีดวง ',
    type: "สมุนไพรจีน"
},{
    id:7,
    img: '64725.jpg',
    name: 'อึ่งคี้',
    price: 500,
    description: '"อึ่งคี้" หรือ "ปักคี้" สมุนไพรจีนที่เป็นพืชล้มลุกตระกูลถั่ว มีกลิ่นหอม รสหวาน มักจะใช้ส่วนลำต้นมาตากแดด อบแห้ง หรือรมควัน เพื่อทำเป็นส่วนประกอบของยาสมุนไพร กรรมวิธีทำต่างกัน ก็จะทำให้ได้คุณสมบัติทางยาที่ต่างกันด้วยคุณสมบัติทางยา : มีรสหวาน อุ่นเล็กน้อย ช่วยบำรุงปอด และม้าม ระงับเหงื่อ ขับปัสสาวะ ลดอาการบวม ทำให้เลือดลมไหลเวียนดี ระงับปวด ช่วยรักษาบาดแผลและสร้างเนื้อเยื่อ ',
    type: "สมุนไพรจีน"
},{
    id:8,
    img: '82125.jpg',
    name: 'Lemon balm (มะนาวบาล์ม)',
    price: 300,
    description: 'Lemon balm (หรือสะระแหน่) มะนาวบาล์มมีกลิ่นหอมสดชื่นคล้ายกลิ่นเลม่อน ใช้สำหรับประกอบอาหารและทำชาสมุนไพรให้กลิ่นหอม รู้สึกดี ช่วยสนับสนุนอารมณ์ด้านบวก บรรเทาความเครียด และช่วยเพิ่มความผ่อนคลายด้วย',
    type: "ชาสมุนไพรญี่ปุ่น"
},{
    id:9,
    img: '92125.jpg',
    name: 'Sage (ใบเสจ)',
    price: 400,
    description: 'เป็นพืชจำพวก Salvia เนื้อใบนุ่ม เมื่อขยี้จะมีกลิ่นหอมมาก รสหอมขม ดอกสวยน่ารัก สามารถใช้ใบเสจเป็นยารักษาอาการเบื่ออาหาร และลดระดับไขมันเลือดได้ แต่เพราะใบเสจมีกลิ่นหอมฉุน คนที่เพิ่งเริ่มต้นรับประทานอาจจะรู้สึกแปลกๆ แต่ก็มีคนจำนวนไม่น้อยที่รักการรับประทานใบเสจเป็นชาสมุนไพร เพราะมีสรรพคุณช่วยเพิ่มสมาธิ ผ่อนคลายความวิตกกังวลได้',
    type: "ชาสมุนไพรญี่ปุ่น"
},{
    id:10,
    img: '102125.jpg',
    name: ' Dandelion (ดอกแดนดิไล)',
    price: 300,
    description: 'Dandelion ดอกแดนดิไลหรือเรียกเป็นภาษาญี่ปุ่นว่า たんぽぽ Tanpopo ไม่ใช่แค่ต้นหญ้าป่าเท่านั้น มีสรรพคุณช่วยบำรุงตับ ช่วยกระตุ้นการสร้างน้ำดีที่ตับและเพิ่มการไหลน้ำดีไปยังถุงน้ำดี สามารถนำมาทำเป็นชาสมุนไพรอร่อยถูกใจสาวๆ เพราะเชื่อกันว่าเป็น detox herbs อย่างดีและมีเบต้าแคโรทีน และสารต้านอนุมูลอิสระสูงมาก',
    type: "ชาสมุนไพรญี่ปุ่น"
},{
    id:11,
    img: '112125.jpg',
    name: 'Mint (มินต์)',
    price: 100,
    description: 'พืชตะกูลมินต์มีเยอะแยะมากมาย มีกลิ่นหอมรสชาติสมุนไพรที่ทานแล้วให้ความรู้สึกสดชื่นรื่นใจ ส่งผลให้จิตใจรู้สึกกระปรี้กระเปร่า สดชื่น ผ่อนคลายจากอาการเมื่อยล้า เมื่อนำมาทำเครื่องดื่มผสมเลม่อนหรือโซดายิ่งอร่อยถูกใจ หรือนำมาทำเครื่องดื่มประเภทปั่น Shake and Smoothie ก็เป็นหนึ่งในเครื่องดื่มที่ให้ความสดชื่นมากๆ',
    type: "ชาสมุนไพรญี่ปุ่น"
},{
    id:12,
    img: '122125.jpg',
    name: 'Lemon grass (ตะไคร้)',
    price: 100,
    description: 'Lemon grass ตะไคร้ มีกลิ่นหอมแบบสมุนไพรทางเอเซีย มองผ่านๆ ก็ดูเหมือนพืชทั่วไป แต่เมื่อดมดูแล้วจะพบว่ามีกลิ่นแบบ "นี่คือกลิ่นหอมสดชื่น" มีกลิ่นหอมสดชื่นที่เป็นจุดเด่นเฉพาะเพราะมีน้ำมันหอมระเหยประกอบอยู่มาก เป็นอีกหนึ่งในสมุนไพรที่ถูกแนะนำให้ชงเป็นชาสมุนไพร เพราะทั้งหอมแล้วยังอร่อยถูกปาก',
    type: "ชาสมุนไพรญี่ปุ่น" 
},{
    id:13,
    img: '132125.jpg',
    name: 'Rose hips (โรสฮิป)',
    price: 200,
    description: 'Rose hips โรสฮิป คือ ผลไม้ของดอกกุหลาบป่า Fruit of wild roses มีสรรพคุณหลักๆ คือช่วยต้านอนุมูลอิสระ ทำให้ผิวกระจ่างใส ช่วยลดเลือนริ้วรอย จุดด่างดำ ฟื้นฟูเซลล์ผิวจากการทำลายของแสงแดดและมลภาวะแวดล้อม ส่วนใหญ่ชงร่วมกับกับดอกชบา หรือ hibiscus อาจจะมีรสออกเปรี้ยวนิดหน่อย แต่มีประโยชน์และอร่อยเป็นที่นิยมขอบสาวๆ มาก    ',
    type: "ชาสมุนไพรญี่ปุ่น" 
},{
    id:14,
    img: '142125.jpg',
    name: 'Lavender (ลาเวนเดอร์)',
    price: 300,
    description: 'Lavender ลาเวนเดอร์ เป็นอีกหนึ่งในสมุนไพรยอดนิยม มีดอกสีม่วงเป็นช่อๆ สวยงามมาก เหมือนจะเป็นดอกไม่ที่ไม่มีอิมเมจว่าจะนำมารับประทานหรือนำมาชงดื่มได้เลย แต่ที่แนะนำคือ นำสมุนไพรลาเวนเดอ์เลม่อนโซดานั่นเอง นอกจากอร่อยแล้วยังมีสีสันที่สวยน่ารักมากมาย',
    type: "ชาสมุนไพรญี่ปุ่น" 
},{
    id:15,
    img: '152125.jpg',
    name: 'Ginseng(โสม)',
    price: 500,
    description: 'พืชพรรณที่ขึ้นเองตามธรรมชาติบนคาบสมุทรเกาหลี แต่ด้วยความที่เป็นพืชที่มีความต้องการสภาพแวดล้อมจำเพาะสูง โสมยังพบได้ในภาคตะวันออกเฉียงเหนือของจีน ไซบีเรีย จนถึงญี่ปุ่น จักรพรรดิจีนเองยังต้องให้เหล่าทหารออกตามล่าหาโสมป่ามาปรุงยา หวังพึ่งพาคุณประโยชน์จากธรรมชาติที่ได้รับการกล่าวถึงอย่างกว้างขวาง โสมจึงเป็นยา ในขณะเดียวกันก็เป็นสมุนไพรราคาสูง 1.ใช้เป็นยาอายุวัฒนะ บำรุงกำลัง บำรุงร่างกาย บำรุงอวัยวะต่างๆเช่น ปอด ตับ ม้าม หัวใจ เป็นต้น2.ช่วยลดความอ่อนเพลียในร่ายกาย รวมทั้งช่วยปรับสมดุลในร่างกาย3.รักษาอาการเป็นลม หน้ามืด เหงื่อออกไม่รู้ตัว4.บำรุงหัวใจ ป้องกันรักษาโรคที่เกิดขึ้นกับหัวใจเช่น หัวใจเต้นผิดปกติ หัวใจขาดเลือดและภาวะเส้นเลือดอุดตันที่หัวใจ5.ช่วยบำรุงเลือด สร้างเม็ดเลือดแดง ต้านการจับตัวของเกล็ดเลือดและโรคผนังเส้นเลือดแดงใหญ่หนาและแข็ง6.บรรเทาอาการที่เกิดจากโรคมะเร็ง รวมทั้งช่วยลดผลข้างเคียงจากการรักษามะเร็งด้วยรังสี7.รักษาโรคต่างๆ เช่น โรคกระเพาะ เบาหวาน ความดัน สมองเสื่อมหรืออาการวัยทอง เป็นต้น8.เสริมสร้างสมดุลทางเพศเช่น กระตุ้นการสร้างอสุจิ เร่งการเจริญเติบโตของรังไข่และการตกไข่9.มีสารต้านอนุมูลอิสระสูง ช่วยทำให้ผิวพรรณเปร่งปรั่ง ลดริ้วรอยและทำให้ผิวชุ่มชื้น ',
    type: "สมุนไพรเกาหลี" 
},{
    id:16,
    img: '162125.jpg',
    name: 'เห็ดหลินจือจากแดนมังกร',
    price: 500,
    description: 'ได้รับสมญามาแต่ครั้งโบราณกาลว่า “ยาอายุวัฒนะ” นั่นคือ “เห็ดหลินจือ” เห็ดหลินจือนับเป็นสมุนไพรคุณค่าสูงแต่หายาก คัมภีร์โบราณ “เสินหนงเปินเฉ่า” ซึ่งเป็นตำราเก่าแก่ที่สุดของจีนและมีผู้คนนับถือมากที่สุด กล่าวเอาไว้ว่าสมุนไพรชนิดนี้เป็น “เทพเจ้าแห่งชีวิต” (Spiritual Essence) ด้วยตำนานเล่าขานถึงผลลัพธ์หลากหลายประการ ทำให้เห็ดหลินจือได้รับความนิยมมากกว่า 2,000 ปี นับตั้งแต่สมัยจักรพรรดิฉินซี คุณประโยชน์มากมาย อาทิ ควบคุมระดับน้ำตาลในเลือด ปรับปรุงระบบภูมิคุ้มกันโรค ปกป้องตับจากสารพิษอันตราย',
    type: "สมุนไพรจีน" 
}];

// [{},{},{}] // length =3
$(document).ready(() => {
    var html ='';
    for (let i = 0; i < product.length; i++) {
        html += `<div onclick="openProductDetail(${i})" class="product-items ${product[i].type}">
                    <img class="product-img" src="${product[i].img}" alt="">
                    <p style="font-size: 1.2vw;">${product[i].name}</p>
                    <p style="font-size: 1vw;">${product[i].price} THB</p>
                </div>`; 

    }
    $("#productlist").html(html);
})


function searchsomething(elem) {
    // console.log('#'+elem.id)
    var value = $('#'+elem.id).val()
    console.log(value)


    var html ='';
    for (let i = 0; i < product.length; i++) {
        if( product[i].name.includes(value) ) {
            html += `<div onclick="openProductDetail(${i})" class="product-items ${product[i].type}">
                    <img class="product-img" src="${product[i].img}" alt="">
                    <p style="font-size: 1.2vw;">${product[i].name}</p>
                    <p style="font-size: 1vw;">${product[i].price} THB</p>
                </div>`; 
        }
    }
    if(html == '') {
        $("#productlist").html(`<p>Not found product</p>`);

    } else {
        $("#productlist").html(html);
    }
   

}

function searchproduct(param) {
    console.log(param)
    $(".product-items").css('display', 'none')
    if(param == 'all') {
        $(".product-items").css('display', 'block')
    }
    else {
        $("."+param).css('display', 'block')
    }
}

var productindex = 0;
function openProductDetail(index) {
    productindex = index;
    console.log(productindex)
    $("#modalDesc").css('display', 'flex')
    $("#mdd-img").attr('src', product[index].img);
    $("#mdd-name").text(product[index].name)
    $("#mdd-price").text(product[index].price)
    $("#mdd-desc").text(product[index].description)
     
}

function closeModal() {
    $(".modal").css('display','none')
}

var cart = [];
function addtocart() {
    var pass = true;

    for (let i = 0; i < cart.length; i++) {
        if( productindex == cart[i].index ) {
            console.log('found same product')
            cart[i].count++;
            pass = false;
        }
    }

    if(pass) {
        var obj = {
            index: productindex,
            id: product[productindex].id,
            name: product[productindex].name,
            price: product[productindex].price,
            img: product[productindex].img,
            count: 1
        };
        // console.log(obj)
        cart.push(obj)
    }
    console.log(cart)

    Swal.fire({
        icon: 'success',
        title: 'Add ' + product[productindex].name + ' to cart !'
    })
    $("#cartcount").css('display','flex').text(cart.length)
}

function openCart() {
    $('#modalCart').css('display','flex')
    rendercart();
}

function rendercart() {
    if(cart.length > 0) {
        var html = '';
        for (let i = 0; i < cart.length; i++) {
            html += `<div class="cartlist-items">
            <div class="cartlist-left">
                <img src="${cart[i].img}" alt="">
                <div class="cartlist-detail">
                    <p style="font-size: 1.5vw;">${cart[i].name}</p>
                    <p style="font-size: 1vw;">${product[i].price * cart[i].count}</p>
                </div>
            </div>
            <div class="cartlist-right">
                <p onclick="deinitems('-', ${i})" class="btnc">-</p>
                <p id="countitems${i}" style="margin: 0 20px;">${cart[i].count}</p>
                <p onclick="deinitems('+', ${i})" class="btnc">+</p>
            </div>
        </div>`
        }
        $("#mycart").html(html)

    }
    else {
        $("#mycart").html(`<p>Not found product list</p>`)
    }
}

function deinitems(action, index) {
    if(action == '-') {
        if(cart[index].count > 0) {
            cart[index].count--;
            $("#countitems"+index).text(cart[index].count)

            if(cart[index].count <= 0) {
                Swal.fire({
                    icon: 'warning',
                    title: 'Are you sure to delete?',
                    showConfirmButton: true,
                    showCancelButton: true,
                    confirmButtonText: 'Delete',
                    cancelButtonText: 'Cancel'
                }).then((res) => {
                  if(res.isConfirmed) {
                     cart.splice(index, 1) 
                     console.log(cart)
                     rendercart();
                     $("#cartcount").css('display','flex').text(cart.length)
                     
                     if(cart.length <= 0) {
                        $("#cartcount").css('display','none')
                     }
                  }  
                  else {
                    cart[index].count++;
                    $("#countitems"+index).text(cart[index].count)
                    rendercart();
                  }
                })
            }
            rendercart();
        }
        
    }
    else if(action == '+') {
        cart[index].count++;
        $("#countitems"+index).text(cart[index].count)
        rendercart();
    }
}